pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_routine_inlining.h
typedef void (*categoryMethodSignature_pic_31__38_PiccoloInstruction_performInlining) (const class cPtr_pic_31__38_PiccoloInstruction * inObject,
                                                                                       const class GALGAS_stringset constinArgument0,
                                                                                       const class GALGAS_declaredRoutineMap constinArgument1,
                                                                                       const class GALGAS_stringset constinArgument2,
                                                                                       class GALGAS_pic_31__38_InstructionList & ioArgument3,
                                                                                       class C_Compiler * inCompiler
                                                                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------------------------------------------------*

void enterCategoryMethod_performInlining (const int32_t inClassIndex,
                                          categoryMethodSignature_pic_31__38_PiccoloInstruction_performInlining inMethod) ;

//---------------------------------------------------------------------------------------------------------------------*

void callCategoryMethod_performInlining (const class cPtr_pic_31__38_PiccoloInstruction * inObject,
                                         const GALGAS_stringset constin_inInlinedRoutineSet,
                                         const GALGAS_declaredRoutineMap constin_inDeclaredRoutineMap,
                                         const GALGAS_stringset constin_inCurrentlyInlinedRoutineSet,
                                         GALGAS_pic_31__38_InstructionList & io_ioInstructionList,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------------------------------------------------*
//                                                                                                                     *
//                                        @declaredRoutineMap_2D_element struct                                        *
//                                                                                                                     *
//---------------------------------------------------------------------------------------------------------------------*

class GALGAS_declaredRoutineMap_2D_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_luint mAttribute_mRequiredBank ;
  public : GALGAS_luint mAttribute_mReturnedBank ;
  public : GALGAS_bool mAttribute_mPreservesBank ;
  public : GALGAS_bool mAttribute_mIsNoReturn ;
  public : GALGAS_pic_31__38_InstructionList mAttribute_mInstructionList ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_declaredRoutineMap_2D_element constructor_default (LOCATION_ARGS) ;

//--------------------------------- Default constructor
  public : GALGAS_declaredRoutineMap_2D_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_declaredRoutineMap_2D_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_declaredRoutineMap_2D_element (const GALGAS_lstring & in_lkey,
                                                 const GALGAS_luint & in_mRequiredBank,
                                                 const GALGAS_luint & in_mReturnedBank,
                                                 const GALGAS_bool & in_mPreservesBank,
                                                 const GALGAS_bool & in_mIsNoReturn,
                                                 const GALGAS_pic_31__38_InstructionList & in_mInstructionList) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_declaredRoutineMap_2D_element extractObject (const GALGAS_object & inObject,
                                                                      C_Compiler * inCompiler
                                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_declaredRoutineMap_2D_element constructor_new (const class GALGAS_lstring & inOperand0,
                                                                        const class GALGAS_luint & inOperand1,
                                                                        const class GALGAS_luint & inOperand2,
                                                                        const class GALGAS_bool & inOperand3,
                                                                        const class GALGAS_bool & inOperand4,
                                                                        const class GALGAS_pic_31__38_InstructionList & inOperand5
                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const int32_t inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_declaredRoutineMap_2D_element & inOperand) const ;

//--------------------------------- Setters

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Getters
  public : VIRTUAL_IN_DEBUG class GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG class GALGAS_pic_31__38_InstructionList reader_mInstructionList (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG class GALGAS_bool reader_mIsNoReturn (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG class GALGAS_bool reader_mPreservesBank (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG class GALGAS_luint reader_mRequiredBank (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG class GALGAS_luint reader_mReturnedBank (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_declaredRoutineMap_2D_element class


//---------------------------------------------------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_declaredRoutineMap_2D_element ;

//---------------------------------------------------------------------------------------------------------------------*
//                                                                                                                     *
//                                   Class for element of '@declaredRoutineMap' map                                    *
//                                                                                                                     *
//---------------------------------------------------------------------------------------------------------------------*

class cMapElement_declaredRoutineMap : public cMapElement {
//--- Map attributes
  public : GALGAS_luint mAttribute_mRequiredBank ;
  public : GALGAS_luint mAttribute_mReturnedBank ;
  public : GALGAS_bool mAttribute_mPreservesBank ;
  public : GALGAS_bool mAttribute_mIsNoReturn ;
  public : GALGAS_pic_31__38_InstructionList mAttribute_mInstructionList ;

//--- Constructor
  public : cMapElement_declaredRoutineMap (const GALGAS_lstring & inKey,
                                           const GALGAS_luint & in_mRequiredBank,
                                           const GALGAS_luint & in_mReturnedBank,
                                           const GALGAS_bool & in_mPreservesBank,
                                           const GALGAS_bool & in_mIsNoReturn,
                                           const GALGAS_pic_31__38_InstructionList & in_mInstructionList
                                           COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const int32_t inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
